Wannesgarrevoet/nbus-esp32/firmware/firmware.ino
void addField(String& p, const char* name, const char* label, const String& value,
              const char* type) {
  p += F("<label>");
  p += label;
  p += F("<input name='");
  p += name;
  p += F("' type='");
  p += type;
  p += F("' value='");
  p += htmlEscape(value);
  p += F("'></label>");
}

void handleConfigGet() {
  String p = F("<!doctype html><meta name=viewport content='width=device-width,initial-scale=1'>"
               "<title>N-Bus settings</title><style>"
               "body{font-family:sans-serif;max-width:24em;margin:2em auto;padding:0 1em}"
               "label{display:block;margin:.7em 0}"
               "input{width:100%;padding:.4em;box-sizing:border-box}"
               "button{padding:.6em 1.2em;margin-top:1em}</style>"
               "<h2>MQTT settings</h2><form method='POST'>");
  addField(p, "host", "Broker host (Home Assistant IP)", cfg.host, "text");
  addField(p, "port", "Port", String(cfg.port), "number");
  addField(p, "user", "Username", cfg.user, "text");
  addField(p, "pass", "Password (blank = keep current)", "", "password");
  addField(p, "base", "Base topic", cfg.base, "text");
  p += F("<button type='submit'>Save &amp; reconnect</button></form>");
  httpServer.send(200, "text/html", p);
}

void handleConfigPost() {
  if (httpServer.hasArg("host")) cfg.host = httpServer.arg("host");
  if (httpServer.hasArg("port")) cfg.port = httpServer.arg("port").toInt();
  if (httpServer.hasArg("user")) cfg.user = httpServer.arg("user");
  // An empty password field means "unchanged", so the other fields can be edited
  // without having to retype the broker password.
  if (httpServer.arg("pass").length()) cfg.pass = httpServer.arg("pass");
  if (httpServer.hasArg("base")) cfg.base = httpServer.arg("base");
  if (cfg.port == 0) cfg.port = 1883;
  if (cfg.base.isEmpty()) cfg.base = NBUS_DEFAULT_BASE_TOPIC;
  saveConfig();
  Serial.printf("[cfg] saved MQTT %s:%u user '%s' base '%s'\n",
                cfg.host.c_str(), cfg.port, cfg.user.c_str(), cfg.base.c_str());

  // Reconnect immediately with the new settings and re-announce discovery, so a
  // changed base topic reaches Home Assistant without a reboot.
  mqtt.disconnect();
  g_discoverySent = false;
  g_mqttFailCount = 0;
  g_lastMqttTryMs = 0;
  httpServer.send(200, "text/html",
                  F("<!doctype html><meta name=viewport content='width=device-width,initial-scale=1'>"
                    "<p>Saved — reconnecting to the broker.</p><p><a href='/config'>Back</a></p>"));
}

void onWifiUp() {
  if (g_shouldSaveConfig) {
    g_shouldSaveConfig = false;
    cfg.host = pHost.getValue();
    cfg.port = atoi(pPort.getValue());
    cfg.user = pUser.getValue();
    cfg.pass = pPass.getValue();
    cfg.base = pBase.getValue();
    cfg.otaUser = pOtaU.getValue();
    cfg.otaPass = pOtaP.getValue();
    if (cfg.port == 0) cfg.port = 1883;
    if (cfg.base.isEmpty()) cfg.base = NBUS_DEFAULT_BASE_TOPIC;
    saveConfig();
    Serial.println(F("[wifi] saved MQTT config"));
  }
  Serial.print(F("[wifi] connected, IP "));
  Serial.println(WiFi.localIP());

  // Deferred until now: the portal serves its own page on :80 while it is up.
  if (!cfg.otaUser.isEmpty()) {
    ElegantOTA.setAuth(cfg.otaUser.c_str(), cfg.otaPass.c_str());
  }
  httpServer.on("/", []() {
    httpServer.send(200, "text/html",
                    F("<!doctype html><meta name=viewport content='width=device-width,initial-scale=1'>"
                      "<h2>N-Bus camper bridge</h2>"
                      "<p><a href='/config'>MQTT settings</a></p>"
                      "<p><a href='/update'>Firmware update</a></p>"));
  });
  httpServer.on("/config", HTTP_GET, handleConfigGet);
  httpServer.on("/config", HTTP_POST, handleConfigPost);
  ElegantOTA.begin(&httpServer);
  httpServer.begin();
  Serial.println(F("[ota] web server on :80 (/update)"));
  g_netServicesUp = true;

  mqttConnect();
}

void handleProvisioning() {
  if (!g_portalActive) return;
  if (wm.process()) {
    g_portalActive = false;
    wm.stopConfigPortal();  // frees port 80 before the OTA server binds to it
    onWifiUp();
  }
}

// --------------------------------------------------------------------------
// MQTT + Home Assistant discovery
// --------------------------------------------------------------------------
String statusTopic()  { return cfg.base + "/status"; }
String batteryTopic() { return cfg.base + "/battery"; }
String solarTopic()   { return cfg.base + "/solar"; }
String starterTopic() { return cfg.base + "/starter"; }

void addDevice(JsonObject dev) {
  JsonArray ids = dev["ids"].to<JsonArray>();
  ids.add(NBUS_DEVICE_ID);
  dev["name"] = NBUS_DEVICE_NAME;
  dev["mf"]   = NBUS_DEVICE_MF;
  dev["mdl"]  = NBUS_DEVICE_MDL;
}

void publishDiscoverySensor(const char* key, const char* name, const char* stateTopic,
                            const char* valTpl, const char* unit, const char* devCla,
                            const char* stateCla = "measurement") {
  JsonDocument doc;
  doc["name"]         = name;
  doc["uniq_id"]      = String(NBUS_DEVICE_ID) + "_" + key;
  doc["stat_t"]       = stateTopic;
  doc["val_tpl"]      = valTpl;
  if (unit && unit[0])   doc["unit_of_meas"] = unit;
  if (devCla && devCla[0]) doc["dev_cla"]    = devCla;
  if (stateCla && stateCla[0]) doc["stat_cla"] = stateCla;
  doc["avty_t"]       = statusTopic();
  addDevice(doc["dev"].to<JsonObject>());

  String topic = String(NBUS_HA_PREFIX) + "/sensor/" + NBUS_DEVICE_ID + "_" + key + "/config";
  String payload;
  serializeJson(doc, payload);
  mqtt.publish(topic.c_str(), payload.c_str(), true);
}

void publishDiscovery() {
  const String bt = batteryTopic();
  const String st = solarTopic();
  const String rt = starterTopic();

  publishDiscoverySensor("battery_soc",     "Leisure battery SoC",     bt.c_str(), "{{ value_json.soc }}",     "%", "battery");
  publishDiscoverySensor("battery_voltage", "Leisure battery voltage", bt.c_str(), "{{ value_json.voltage }}", "V", "voltage");
  publishDiscoverySensor("battery_current", "Leisure battery current", bt.c_str(), "{{ value_json.current }}", "A", "current");
  publishDiscoverySensor("battery_power",   "Leisure battery power",   bt.c_str(), "{{ value_json.power }}",   "W", "power");
  publishDiscoverySensor("cell1_voltage",   "Battery cell 1 voltage",  bt.c_str(), "{{ value_json.cells[0] }}", "V", "voltage");
  publishDiscoverySensor("cell2_voltage",   "Battery cell 2 voltage",  bt.c_str(), "{{ value_json.cells[1] }}", "V", "voltage");
  publishDiscoverySensor("cell3_voltage",   "Battery cell 3 voltage",  bt.c_str(), "{{ value_json.cells[2] }}", "V", "voltage");
  publishDiscoverySensor("cell4_voltage",   "Battery cell 4 voltage",  bt.c_str(), "{{ value_json.cells[3] }}", "V", "voltage");
  publishDiscoverySensor("battery_energy",   "Leisure battery energy remaining", bt.c_str(), "{{ value_json.energy }}",   "Wh", "energy_storage");
  publishDiscoverySensor("battery_quality",  "Leisure battery quality",          bt.c_str(), "{{ value_json.quality }}",  "%",  "");
  publishDiscoverySensor("battery_capacity", "Leisure battery capacity",         bt.c_str(), "{{ value_json.capacity }}", "Ah", "");
  // The battery reports its own runtime estimate in register 0x34; it is not derived
  // here. Only the half matching the current direction of travel is ever published.
  publishDiscoverySensor("battery_to_empty", "Leisure battery time to empty", bt.c_str(), "{{ value_json.to_empty }}", "min", "duration");
  publishDiscoverySensor("battery_to_full",  "Leisure battery time to full",  bt.c_str(), "{{ value_json.to_full }}",  "min", "duration");
  // Lifetime counters, so total_increasing rather than measurement: HA must not treat a
  // counter reset as a huge negative reading.
  publishDiscoverySensor("battery_discharged", "Leisure battery energy discharged", bt.c_str(),
                         "{{ value_json.discharged }}", "Wh", "energy", "total_increasing");
  publishDiscoverySensor("battery_charged",    "Leisure battery energy charged",    bt.c_str(),
                         "{{ value_json.charged }}",    "Wh", "energy", "total_increasing");
  publishDiscoverySensor("solar_voltage",   "Solar charger voltage",   st.c_str(), "{{ value_json.voltage }}", "V", "voltage");
  publishDiscoverySensor("solar_current",   "Solar charge current",    st.c_str(), "{{ value_json.current }}", "A", "current");
  publishDiscoverySensor("starter_voltage", "Starter battery voltage", rt.c_str(), "{{ value_json.voltage }}", "V", "voltage");
  Serial.println(F("[mqtt] discovery published"));
}

