Wannesgarrevoet/nbus-esp32/firmware/firmware.ino
bool mqttConnect() {
  if (cfg.host.isEmpty()) return false;
  mqtt.setServer(cfg.host.c_str(), cfg.port);
  mqtt.setBufferSize(512);

  String clientId = String(NBUS_DEVICE_ID) + "-" + String((uint32_t)ESP.getEfuseMac(), HEX);
  const char* user = cfg.user.isEmpty() ? nullptr : cfg.user.c_str();
  const char* pass = cfg.pass.isEmpty() ? nullptr : cfg.pass.c_str();

  bool ok = mqtt.connect(clientId.c_str(), user, pass,
                         statusTopic().c_str(), 0, true, "offline");
  if (ok) {
    mqtt.publish(statusTopic().c_str(), "online", true);
    g_discoverySent = false;  // re-send discovery on (re)connect
    g_mqttFailCount = 0;
    Serial.println(F("[mqtt] connected"));
  } else {
    Serial.print(F("[mqtt] connect failed, state="));
    Serial.println(mqtt.state());
  }
  return ok;
}

// --------------------------------------------------------------------------
// State publishing
// --------------------------------------------------------------------------
void publishState() {
  const NBusState& s = parser.state();
  const uint32_t now = millis();

  // Battery
  if (s.batt_voltage_valid && (now - g_lastBattMs) < NBUS_STALE_MS) {
    JsonDocument doc;
    if (s.batt_soc_valid)     doc["soc"]     = s.batt_soc;
    if (s.batt_voltage_valid) doc["voltage"] = roundf(s.batt_voltage * 100) / 100.0;
    if (s.batt_wh_valid)       doc["energy"]   = s.batt_wh;
    if (s.batt_quality_valid)  doc["quality"]  = s.batt_quality;
    if (s.batt_capacity_valid) doc["capacity"] = s.batt_capacity_ah;
    if (s.batt_to_empty_valid)  doc["to_empty"]   = s.batt_to_empty_min;
    if (s.batt_to_full_valid)   doc["to_full"]    = s.batt_to_full_min;
    if (s.batt_discharged_valid) doc["discharged"] = s.batt_discharged_wh;
    if (s.batt_charged_valid)    doc["charged"]    = s.batt_charged_wh;
    if (s.batt_current_valid) {
      doc["current"] = roundf(s.batt_current * 100) / 100.0;
      doc["power"]   = roundf(s.batt_voltage * s.batt_current * 10) / 10.0;
    }
    bool anyCell = s.cell_valid[0] || s.cell_valid[1] || s.cell_valid[2] || s.cell_valid[3];
    if (anyCell && (now - g_lastCellMs) < NBUS_STALE_MS) {
      JsonArray cells = doc["cells"].to<JsonArray>();
      for (int i = 0; i < 4; ++i) cells.add(roundf(s.cell_v[i] * 1000) / 1000.0);
    }
    String payload; serializeJson(doc, payload);
    mqtt.publish(batteryTopic().c_str(), payload.c_str(), true);
  }

  // Solar charger
  if (s.solar_valid && (now - g_lastSolarMs) < NBUS_STALE_MS) {
    JsonDocument doc;
    doc["voltage"] = roundf(s.solar_voltage * 100) / 100.0;
    doc["current"] = roundf(s.solar_current * 100) / 100.0;
    String payload; serializeJson(doc, payload);
    mqtt.publish(solarTopic().c_str(), payload.c_str(), true);
  }

  // Starter battery
  if (s.starter_valid && (now - g_lastStarterMs) < NBUS_STALE_MS) {
    JsonDocument doc;
    doc["voltage"] = roundf(s.starter_voltage * 100) / 100.0;
    String payload; serializeJson(doc, payload);
    mqtt.publish(starterTopic().c_str(), payload.c_str(), true);
  }
}

// --------------------------------------------------------------------------
// Raw register mirror
//
// Registers the parser understands become named sensors above. Everything else would
// otherwise be discarded, and that is precisely the data a post-mortem needs: on a
// healthy bus the candidate alarm registers (0xC0, 0xF0, 0xF1, 0xF2) are all zero, which
// looks exactly like an unused register. Only a capture taken while the fault is
// happening can tell those apart, and the fault is intermittent — so it has to be
// recorded continuously, unattended.
//
// Each pair gets its own retained topic, so the broker timestamps every change for free
// and a constant register costs one message ever. No discovery config is published:
// naming an entity would claim a meaning we have not established.
// --------------------------------------------------------------------------
struct RegMirror {
  uint8_t  nad = 0, reg = 0;
  uint8_t  data[4] = {0, 0, 0, 0};
  uint32_t lastPubMs = 0;
  bool     used = false;
};
RegMirror g_regMirror[NBUS_REG_MIRROR_SLOTS];

void mirrorRegister(uint8_t nad, uint8_t reg, const uint8_t* d) {
  if (!mqtt.connected()) return;

  RegMirror* slot = nullptr;
  for (auto& m : g_regMirror) {
    if (m.used && m.nad == nad && m.reg == reg) { slot = &m; break; }
    if (!m.used && slot == nullptr) slot = &m;  // remember the first free slot
  }
  if (slot == nullptr) return;  // table full; a fixed table cannot be flooded by noise

  const bool isNew   = !slot->used;
  const bool changed = isNew || memcmp(slot->data, d, 4) != 0;
  const uint32_t now = millis();

  // Throttle per register rather than globally. A register that never moves publishes
  // the instant it finally does; only a chronically noisy one is rate-limited, and it is
  // the quiet ones that matter here.
  if (!changed) return;
  if (!isNew && (now - slot->lastPubMs) < NBUS_REG_MIRROR_MS) return;

  slot->used = true;
  slot->nad  = nad;
  slot->reg  = reg;
  memcpy(slot->data, d, 4);
  slot->lastPubMs = now;

  char topic[64];
  snprintf(topic, sizeof(topic), "%s/reg/%02X/%02X", cfg.base.c_str(), nad, reg);
  char payload[9];
  snprintf(payload, sizeof(payload), "%02X%02X%02X%02X", d[0], d[1], d[2], d[3]);
  mqtt.publish(topic, payload, true);
}

// --------------------------------------------------------------------------
// LIN frame capture (read-only)
// --------------------------------------------------------------------------
void markFresh(uint8_t nad, uint8_t reg) {
  const uint32_t now = millis();
  if (nad == NBUS_NAD_BATTERY) {
    g_lastBattMs = now;
    if (reg == 0x56 || reg == 0x57) g_lastCellMs = now;
  } else if (nad == NBUS_NAD_SOLAR) {
    if (reg == 0x01) g_lastStarterMs = now;
    else             g_lastSolarMs = now;
  }
}

void processFrameWindow(const uint8_t* buf, size_t len) {
#ifdef NBUS_DEBUG
  // Raw window dump: during bring-up this is what separates "nothing on the wire" from
  // "bytes arrive but framing is off".
  Serial.printf("[raw %2u]", (unsigned)len);
  for (size_t i = 0; i < len; ++i) Serial.printf(" %02X", buf[i]);
  Serial.println();
#endif
  // A frame window (delimited by an idle gap) holds: [break 0x00?] 0x55 PID data... checksum.
  for (size_t i = 0; i + 1 < len; ++i) {
    if (buf[i] != 0x55) continue;
    const uint8_t pid = buf[i + 1];
    if (pid != 0x7D) return;          // not a slave response; ignore this window
    const size_t dStart = i + 2;
    if (len - dStart < 8) return;     // not enough data bytes yet
    const uint8_t* d = &buf[dStart];

    // Optional checksum verification (classic checksum: data bytes only, PID excluded).
    if (len - dStart >= 9) {
      uint8_t expect = NBusParser::classicChecksum(d, 8);
      if (expect != d[8]) {
#ifdef NBUS_DEBUG
        Serial.printf("[lin] checksum mismatch reg=%02X exp=%02X got=%02X\n", d[3], expect, d[8]);
#endif
        return;
      }
    }

